In [1]:
import pandas as pd
import numpy as np

# 8.1 Hierarchical Indexing

Hierarchical indexing (also known as MultiIndexing) in Pandas allows you to work with data that has multiple levels (or dimensions) of indexing on a single axis (usually rows, but it can also be applied to columns). This powerful feature makes it possible to represent and manipulate higher-dimensional data in a 2-dimensional DataFrame. It also enables more intuitive and efficient data slicing, grouping, and reshaping operations.

What Is Hierarchical Indexing?
Definition:
Hierarchical indexing means that an index (or axis) of a DataFrame or Series can have multiple levels. For example, rather than having a single index column with unique values, you could have two (or more) index levels that together uniquely identify a row.

Benefits:

* Data Organization: Allows you to represent data that naturally falls into multiple dimensions (e.g., sales data by region      and by year).
* Efficient Grouping and Aggregation: Simplifies operations like grouping by multiple keys.
* Intuitive Data Slicing: You can select data using tuples that reference different levels of the index.

In [2]:
# let's start from series
s = pd.Series(np.random.randint(1, 100, size = 10),
             index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 2, 1, 3, 3, 1, 2, 3]])

In [3]:
# s is multiIndex Series
s

a  1    47
   2    59
   3    91
b  2     8
   1     5
   3     2
c  3    34
   1    81
d  2    26
   3    69
dtype: int32

In [4]:
# let's check the index of the series
s.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 2),
            ('b', 1),
            ('b', 3),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
# accessing values
s['b']

2    8
1    5
3    2
dtype: int32

In [6]:
# we can also slice
s['a':'c']

a  1    47
   2    59
   3    91
b  2     8
   1     5
   3     2
c  3    34
   1    81
dtype: int32

In [7]:
# using loc operator
s.loc['d']

2    26
3    69
dtype: int32

In [8]:
# accessing two or more values with loc operator
s.loc[['a', 'd']]

a  1    47
   2    59
   3    91
d  2    26
   3    69
dtype: int32

In [9]:
# selection from inner level
# for example let's select '1' 
s[:, 1]

a    47
b     5
c    81
dtype: int32

In [10]:
s.loc[:, 2]

a    59
b     8
d    26
dtype: int32

In [11]:
# we can give names to each index
s.index.names = ['Key 1', 'Key 2']

In [12]:
s

Key 1  Key 2
a      1        47
       2        59
       3        91
b      2         8
       1         5
       3         2
c      3        34
       1        81
d      2        26
       3        69
dtype: int32

Hierarchical indexing plays an important role in reshaping data and in group-based operations like forming a pivot table. For example, you can rearrange this data into a DataFrame using its unstack method:

In [13]:
s.unstack()

Key 2     1     2     3
Key 1
a      47.0  59.0  91.0
b       5.0   8.0   2.0
c      81.0   NaN  34.0
d       NaN  26.0  69.0

In [14]:
# we can back to a series with stack method
s.unstack().stack()

Key 1  Key 2
a      1        47.0
       2        59.0
       3        91.0
b      1         5.0
       2         8.0
       3         2.0
c      1        81.0
       3        34.0
d      2        26.0
       3        69.0
dtype: float64

In [15]:
# Let's see multiIndexing with dataframe
df = pd.DataFrame(np.random.randint(1, 100, size = (4, 3)),
                 index = [['north', 'north', 'south', 'south'], ['a', 'b', 'a', 'b']],
                 columns = [['China', 'China', 'india'], ['Green', 'Red', 'Green']])

In [16]:
print(df)

        China     india
        Green Red Green
north a    68  26    95
      b    24  59    37
south a    73  28    90
      b    92  55    48

In [17]:
# we can give a name for both columns and indeces
df.index.names = ['Key 1', 'Key 2']
df.columns.names = ['Country', 'Color']

In [18]:
print(df)

Country     China     india
Color       Green Red Green
Key 1 Key 2
north a        68  26    95
      b        24  59    37
south a        73  28    90
      b        92  55    48

In [19]:
# we can see number of levels
df.index.nlevels

2

In [20]:
df.columns.nlevels

2

An other way of creating heirachical index is by using "set_index()"" with Multiple Columns
If your DataFrame has multiple columns that together uniquely identify rows, you can convert them into a hierarchical index using set_index()

In [21]:
data = {
    'Region': ['North', 'North', 'South', 'South', 'East', 'East'],
    'Year': [2020, 2021, 2020, 2021, 2020, 2021],
    'Sales': [250, 300, 200, 350, 150, 400]
}
df_one = pd.DataFrame(data)
df_multi = df_one.set_index(['Region', 'Year'])

In [22]:
df_multi

             Sales
Region Year
North  2020    250
       2021    300
South  2020    200
       2021    350
East   2020    150
       2021    400

Creating a MultiIndex Directly
You can also create a MultiIndex object directly from arrays or tuples using pd.MultiIndex.from_tuples() or pd.MultiIndex.from_product().

In [23]:
tuples = [
    ('North', 2020),
    ('North', 2021),
    ('South', 2020),
    ('South', 2021),
    ('East', 2020),
    ('East', 2021)
]
multi_index = pd.MultiIndex.from_tuples(tuples, names=['Region', 'Year'])
df_direct = pd.DataFrame({'Sales': [250, 300, 200, 350, 150, 400]}, index=multi_index)

In [24]:
df_direct

             Sales
Region Year
North  2020    250
       2021    300
South  2020    200
       2021    350
East   2020    150
       2021    400

In [25]:
# accessing values
df_direct.loc['North']

      Sales
Year
2020    250
2021    300

In [26]:
df_direct.loc['South', 2021]

Sales    350
Name: (South, 2021), dtype: int64

In [27]:
# accessing inner levels using 'xs'
year_2021 = df_direct.xs(2021, level = 'Year')
year_2021

        Sales
Region
North     300
South     350
East      400

####  Reordering and Sorting Levels

In [28]:
# using "swaplevel()" method we can swap levels of the index or columns
df_swapped = df_direct.swaplevel('Year', 'Region')
df_swapped

             Sales
Year Region
2020 North     250
2021 North     300
2020 South     200
2021 South     350
2020 East      150
2021 East      400

In [29]:
# we can sort the index
df_swapped.sort_index()

             Sales
Year Region
2020 East      150
     North     250
     South     200
2021 East      400
     North     300
     South     350

In [30]:
df_direct

             Sales
Region Year
North  2020    250
       2021    300
South  2020    200
       2021    350
East   2020    150
       2021    400

In [31]:
# let's sort the original df
df_direct.sort_index(level = 'Year')

             Sales
Region Year
East   2020    150
North  2020    250
South  2020    200
East   2021    400
North  2021    300
South  2021    350

#### Summary Statistics by Level

In [32]:
df_direct

             Sales
Region Year
North  2020    250
       2021    300
South  2020    200
       2021    350
East   2020    150
       2021    400

In [33]:
# we can do statistical analysis on by each levels
df_direct.groupby(level = 'Region').sum()

        Sales
Region
East      550
North     550
South     550

In [34]:
df_direct.groupby(level = 'Year').sum()

      Sales
Year
2020    600
2021   1050

####  Indexing with a DataFrame’s columns

In [35]:
df = pd.DataFrame({'a': np.random.randint(1, 10, size = 7),
                  'b': np.random.standard_normal(7),
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd': [1, 2, 3, 1, 2, 3, 1]})

In [36]:
df

   a         b    c  d
0  6  1.180280  one  1
1  3  1.358592  one  2
2  4 -0.229196  one  3
3  2 -0.851977  two  1
4  4 -0.660258  two  2
5  9  0.280438  two  3
6  8  2.446914  two  1

DataFrame’s set_index function will create a new DataFrame using one or more of its columns as the index:

In [37]:
df2 = df.set_index(['c', 'd'])
df2

       a         b
c   d
one 1  6  1.180280
    2  3  1.358592
    3  4 -0.229196
two 1  2 -0.851977
    2  4 -0.660258
    3  9  0.280438
    1  8  2.446914

By default, the columns are removed from the DataFrame, though you can leave them in by passing drop=False to set_index

In [38]:
df.set_index(['c', 'd'], drop = False)

       a         b    c  d
c   d
one 1  6  1.180280  one  1
    2  3  1.358592  one  2
    3  4 -0.229196  one  3
two 1  2 -0.851977  two  1
    2  4 -0.660258  two  2
    3  9  0.280438  two  3
    1  8  2.446914  two  1

reset_index, on the other hand, does the opposite of set_index; the hierarchical index levels are moved into the columns:

In [39]:
df2.reset_index()

     c  d  a         b
0  one  1  6  1.180280
1  one  2  3  1.358592
2  one  3  4 -0.229196
3  two  1  2 -0.851977
4  two  2  4 -0.660258
5  two  3  9  0.280438
6  two  1  8  2.446914

#  8.2 Combining and Merging Datasets

Introduction to Joining Data

What Is a Join?
* A join combines rows from two or more DataFrames based on a common key (or keys). Imagine you have one DataFrame with customer details and another with their orders; joining them allows you to analyze purchase behavior along with customer demographics.

Types of Joins
Inner Join:
Returns only the rows where the keys match in both DataFrames.

Left Join:
Returns all rows from the left DataFrame, and matching rows from the right DataFrame (if available). Non-matches will have missing values (NaN) for the right side.

Right Join:
Returns all rows from the right DataFrame and the matching rows from the left DataFrame.

Outer Join:
Returns all rows from both DataFrames, with missing values filled in where a match does not exist.

Using pd.merge() for Joining Data
The pd.merge() function is highly flexible. Here’s the basic syntax:

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, ...)

left and right: The two DataFrames you want to join.
how: The type of join ('inner', 'left', 'right', or 'outer').
on: The column(s) to join on (if the column names are the same in both DataFrames).
left_on and right_on: Specify different column names if they differ between DataFrames.

In [40]:
# Sample Customers DataFrame
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Country': ['USA', 'Canada', 'USA', 'UK']
})

# Sample Orders DataFrame
orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104, 105],
    'CustomerID': [1, 2, 1, 3, 5],  # Note: CustomerID 5 does not exist in customers
    'OrderAmount': [250, 150, 400, 300, 500]
})

In [41]:
customers

   CustomerID     Name Country
0           1    Alice     USA
1           2      Bob  Canada
2           3  Charlie     USA
3           4    David      UK

In [42]:
orders

   OrderID  CustomerID  OrderAmount
0      101           1          250
1      102           2          150
2      103           1          400
3      104           3          300
4      105           5          500

In [43]:
# let's merge with out specifying anything
pd.merge(customers, orders)

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA      101          250
1           1    Alice     USA      103          400
2           2      Bob  Canada      102          150
3           3  Charlie     USA      104          300

In [44]:
# let's specify the column to join
pd.merge(customers, orders, on = 'CustomerID')

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA      101          250
1           1    Alice     USA      103          400
2           2      Bob  Canada      102          150
3           3  Charlie     USA      104          300

In [45]:
# lets determine how we combine them
pd.merge(customers, orders, on = 'CustomerID', how = 'inner')   # intersection of customers and orders

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA      101          250
1           1    Alice     USA      103          400
2           2      Bob  Canada      102          150
3           3  Charlie     USA      104          300

In [46]:
pd.merge(customers, orders, on = 'CustomerID', how = 'left')   # all customers and intersect orders

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA    101.0        250.0
1           1    Alice     USA    103.0        400.0
2           2      Bob  Canada    102.0        150.0
3           3  Charlie     USA    104.0        300.0
4           4    David      UK      NaN          NaN

In [47]:
pd.merge(customers, orders, on = 'CustomerID', how = 'right')    # all orders and intersect customers

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA      101          250
1           2      Bob  Canada      102          150
2           1    Alice     USA      103          400
3           3  Charlie     USA      104          300
4           5      NaN     NaN      105          500

In [48]:
pd.merge(customers, orders, on = 'CustomerID', how = 'outer')    # union of customers and orders

   CustomerID     Name Country  OrderID  OrderAmount
0           1    Alice     USA    101.0        250.0
1           1    Alice     USA    103.0        400.0
2           2      Bob  Canada    102.0        150.0
3           3  Charlie     USA    104.0        300.0
4           4    David      UK      NaN          NaN
5           5      NaN     NaN    105.0        500.0

What if the common column is different?

In [49]:
orders_diff = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'CustID': [1, 2, 1, 3],
    'OrderAmount': [250, 150, 400, 300]
})

In [50]:
orders_diff

   OrderID  CustID  OrderAmount
0      101       1          250
1      102       2          150
2      103       1          400
3      104       3          300

In [51]:
# here in the "orders_diff" there is no "CustomerID" column so
# pd.merge(customers, orders_diff)  # this code raise an error since there is no common column

In [52]:
# we can specify the columns to merge using "right_on" and "left_on"
pd.merge(customers, orders_diff, left_on = 'CustomerID', right_on = 'CustID', how = 'inner')

   CustomerID     Name Country  OrderID  CustID  OrderAmount
0           1    Alice     USA      101       1          250
1           1    Alice     USA      103       1          400
2           2      Bob  Canada      102       2          150
3           3  Charlie     USA      104       3          300

####  Merging on Index

if the dataframes indexed proprately we can combine the by their index rather than by specifying column names

Let's see if both dataframes indexed properly

In [53]:
customers_i = customers.set_index('CustomerID')
orders_i = orders.set_index('CustomerID')

In [54]:
customers_i

               Name Country
CustomerID
1             Alice     USA
2               Bob  Canada
3           Charlie     USA
4             David      UK

In [55]:
orders_i

            OrderID  OrderAmount
CustomerID
1               101          250
2               102          150
1               103          400
3               104          300
5               105          500

In [56]:
pd.merge(customers_i, orders_i, right_index = True, left_index = True, how = 'inner')

               Name Country  OrderID  OrderAmount
CustomerID
1             Alice     USA      101          250
1             Alice     USA      103          400
2               Bob  Canada      102          150
3           Charlie     USA      104          300

In [57]:
# Or we can use the "join()" method
customers_i.join(orders_i, how = 'inner')

               Name Country  OrderID  OrderAmount
CustomerID
1             Alice     USA      101          250
1             Alice     USA      103          400
2               Bob  Canada      102          150
3           Charlie     USA      104          300

In [58]:
employees = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'DeptID': [101, 102, 101, 103] 
})

departments = pd.DataFrame({
    'Department': ['HR', 'Engineering', 'Marketing', 'Sales'],
    'Location': ['Building A', 'Building B', 'Building C', 'Building D']
}, index=[101, 102, 103, 104])

In [59]:
employees

   EmployeeID     Name  DeptID
0           1    Alice     101
1           2      Bob     102
2           3  Charlie     101
3           4    David     103

In [60]:
departments

      Department    Location
101           HR  Building A
102  Engineering  Building B
103    Marketing  Building C
104        Sales  Building D

# to merge these two dataframes we use "right_index = True" or "left_index = True"'

In [61]:
# we combine them by "DeptID"
pd.merge(employees, departments, left_on= 'DeptID', right_index = True)

   EmployeeID     Name  DeptID   Department    Location
0           1    Alice     101           HR  Building A
1           2      Bob     102  Engineering  Building B
2           3  Charlie     101           HR  Building A
3           4    David     103    Marketing  Building C

In [62]:
df1 = pd.DataFrame({
    'key1': ['A', 'B', 'C', 'D'],
    'key2': [1, 2, 3, 4],
    'Value1': [10, 20, 30, 40]
})

index_tuples = [('A', 1), ('B', 2), ('C', 3), ('E', 5)]
multi_index = pd.MultiIndex.from_tuples(index_tuples, names=['key1', 'key2'])

df2 = pd.DataFrame({
    'Value2': [100, 200, 300, 500],
    'Info': ['info_A1', 'info_B2', 'info_C3', 'info_E5']
}, index=multi_index)

With hierarchically indexed data, things are more complicated, as joining on index is equivalent to a multiple-key merge:

In [63]:
df1

  key1  key2  Value1
0    A     1      10
1    B     2      20
2    C     3      30
3    D     4      40

In [64]:
df2

           Value2     Info
key1 key2
A    1        100  info_A1
B    2        200  info_B2
C    3        300  info_C3
E    5        500  info_E5

In [65]:
pd.merge(df1, df2, left_on = ['key1', 'key2'], right_index = True)

  key1  key2  Value1  Value2     Info
0    A     1      10     100  info_A1
1    B     2      20     200  info_B2
2    C     3      30     300  info_C3

We can use "join()" method to merge two or more dataframes

In [66]:
df1 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}, index=['emp1', 'emp2', 'emp3'])

df2 = pd.DataFrame({
    'Department': ['HR', 'Engineering', 'Marketing'],
    'Location': ['New York', 'San Francisco', 'Chicago']
}, index=['emp1', 'emp2', 'emp4'])

df3 = pd.DataFrame({
    'Salary': [70000, 80000, 75000],
    'Bonus': [5000, 6000, 5500]
}, index=['emp1', 'emp3', 'emp4'])

In [67]:
df1

         Name  Age
emp1    Alice   25
emp2      Bob   30
emp3  Charlie   35

In [68]:
df2

       Department       Location
emp1           HR       New York
emp2  Engineering  San Francisco
emp4    Marketing        Chicago

In [69]:
df3

      Salary  Bonus
emp1   70000   5000
emp3   80000   6000
emp4   75000   5500

In [70]:
df1.join([df2, df3], how = 'inner')

       Name  Age Department  Location  Salary  Bonus
emp1  Alice   25         HR  New York   70000   5000

In [71]:
df1.join([df2, df3], how = 'outer')

         Name   Age   Department       Location   Salary   Bonus
emp1    Alice  25.0           HR       New York  70000.0  5000.0
emp2      Bob  30.0  Engineering  San Francisco      NaN     NaN
emp3  Charlie  35.0          NaN            NaN  80000.0  6000.0
emp4      NaN   NaN    Marketing        Chicago  75000.0  5500.0

# Examples

Example 1: Analyzing Sales by Customer
Scenario:
You have one DataFrame with customer details and another with their sales transactions. Your task is to merge these DataFrames on the common key CustomerID and then calculate the total sales for each customer.

In [72]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Country': ['USA', 'Canada', 'USA', 'UK']
})

sales = pd.DataFrame({
    'TransactionID': [101, 102, 103, 104, 105],
    'CustomerID': [1, 2, 1, 3, 1],
    'SalesAmount': [250, 150, 400, 300, 100],
    'Date': ['2023-01-15', '2023-02-20', '2023-03-10', '2023-01-25', '2023-02-05']
})

In [73]:
customers

   CustomerID     Name Country
0           1    Alice     USA
1           2      Bob  Canada
2           3  Charlie     USA
3           4    David      UK

In [74]:
sales

   TransactionID  CustomerID  SalesAmount        Date
0            101           1          250  2023-01-15
1            102           2          150  2023-02-20
2            103           1          400  2023-03-10
3            104           3          300  2023-01-25
4            105           1          100  2023-02-05

In [75]:
merged = pd.merge(customers, sales, on = 'CustomerID', how = 'inner')

In [76]:
merged

   CustomerID     Name Country  TransactionID  SalesAmount        Date
0           1    Alice     USA            101          250  2023-01-15
1           1    Alice     USA            103          400  2023-03-10
2           1    Alice     USA            105          100  2023-02-05
3           2      Bob  Canada            102          150  2023-02-20
4           3  Charlie     USA            104          300  2023-01-25

In [77]:
merged.groupby(['CustomerID', 'Name'])['SalesAmount'].sum().reset_index()

   CustomerID     Name  SalesAmount
0           1    Alice          750
1           2      Bob          150
2           3  Charlie          300

Example 2: Merging Supplementary Employee Data
Scenario:
You have a primary DataFrame with employee records and a secondary DataFrame containing additional details (e.g., department and manager). Your task is to merge these two DataFrames using an outer join so that all employees are included, even if some lack supplementary details.

In [78]:
employees = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

details = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['Sales', 'IT', 'HR'],
    'Manager': ['Eve', 'Frank', 'Grace']
})

In [79]:
employees

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David

In [80]:
details

   EmployeeID Department Manager
0           1      Sales     Eve
1           2         IT   Frank
2           4         HR   Grace

In [81]:
df = pd.merge(employees, details, on = 'EmployeeID', how = 'outer')

In [82]:
df

   EmployeeID     Name Department Manager
0           1    Alice      Sales     Eve
1           2      Bob         IT   Frank
2           3  Charlie        NaN     NaN
3           4    David         HR   Grace

#### Concatenating Along an Axis

Concatenating DataFrames with pd.concat()
The concat() function in Pandas is very flexible and can combine multiple DataFrames along a specified axis.

In [83]:
# recall concatenate from numpy
arr = np.arange(12).reshape(3, 4)

In [84]:
np.concatenate((arr, arr), axis = 0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [85]:
np.concatenate((arr, arr), axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [86]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")

In [87]:
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")

In [88]:
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [89]:
s1

a    0
b    1
dtype: Int64

In [90]:
s2

c    2
d    3
e    4
dtype: Int64

In [91]:
s3

f    5
g    6
dtype: Int64

In [92]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [93]:
pd.concat([s1, s2, s3], axis = 'columns')

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In this case there is no overlap on the other axis, which as you can see is the union (the "outer" join) of the indexes. You can instead intersect them by passing join="inner":

In [94]:
s4 = pd.concat([s1, s2])

In [95]:
s4

a    0
b    1
c    2
d    3
e    4
dtype: Int64

In [96]:
# let's concatenate s2 and s4
pd.concat([s2, s4], axis = 'columns')

      0  1
c     2  2
d     3  3
e     4  4
a  <NA>  0
b  <NA>  1

A potential issue is that the concatenated pieces are not identifiable in the result. Suppose instead you wanted to create a hierarchical index on the concatenation axis. To do this, use the keys argument:

In [97]:
s = pd.concat([s1, s2, s3], keys = ['One', 'Two', 'Three'])

In [98]:
s

One    a    0
       b    1
Two    c    2
       d    3
       e    4
Three  f    5
       g    6
dtype: Int64

In [99]:
s.unstack()

          a     b     c     d     e     f     g
One       0     1  <NA>  <NA>  <NA>  <NA>  <NA>
Two    <NA>  <NA>     2     3     4  <NA>  <NA>
Three  <NA>  <NA>  <NA>  <NA>  <NA>     5     6

In [100]:
january = pd.DataFrame({
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Sales': [200, 250, 300]
})

february = pd.DataFrame({
    'Date': ['2023-02-01', '2023-02-02', '2023-02-03'],
    'Sales': [220, 270, 310]
})

In [101]:
january

         Date  Sales
0  2023-01-01    200
1  2023-01-02    250
2  2023-01-03    300

In [102]:
february

         Date  Sales
0  2023-02-01    220
1  2023-02-02    270
2  2023-02-03    310

In [103]:
df = pd.concat([january, february], ignore_index = True)  # ignore_index=True resets the index after concatenation.

In [104]:
df

         Date  Sales
0  2023-01-01    200
1  2023-01-02    250
2  2023-01-03    300
3  2023-02-01    220
4  2023-02-02    270
5  2023-02-03    310

In [105]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

purchases = pd.DataFrame({
    'CustomerID': [1, 2, 4],
    'TotalPurchases': [500, 300, 400]
})

customers = customers.set_index('CustomerID')
purchases = purchases.set_index('CustomerID')

In [106]:
customers

               Name
CustomerID
1             Alice
2               Bob
3           Charlie

In [107]:
purchases

            TotalPurchases
CustomerID
1                      500
2                      300
4                      400

In [108]:
pd.concat([customers, purchases], axis = 'columns')

               Name  TotalPurchases
CustomerID
1             Alice           500.0
2               Bob           300.0
3           Charlie             NaN
4               NaN           400.0

In [109]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],columns=["one", "two"])

df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],columns=["three", "four"])

In [110]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [111]:
df2

   three  four
a      5     6
c      7     8

Here the keys argument is used to create a hierarchical index where the first level can be used to identify each of the concatenated DataFrame objects.

In [112]:
# concatenate "df1" and "df2" vertically
dfv = pd.concat([df1, df2], keys = ['key 1', 'key 2'])

In [113]:
dfv

         one  two  three  four
key 1 a  0.0  1.0    NaN   NaN
      b  2.0  3.0    NaN   NaN
      c  4.0  5.0    NaN   NaN
key 2 a  NaN  NaN    5.0   6.0
      c  NaN  NaN    7.0   8.0

In [114]:
# concatenate horizontally
dfh = pd.concat([df1, df2], axis = 'columns', keys = ['level 1', 'level 2'])

In [115]:
dfh

  level 1     level 2
      one two   three four
a       0   1     5.0  6.0
b       2   3     NaN  NaN
c       4   5     7.0  8.0

In [116]:
# we can pass as a dictionary
pd.concat({"level 1": df1, "level 2": df2}, axis="columns")

  level 1     level 2
      one two   three four
a       0   1     5.0  6.0
b       2   3     NaN  NaN
c       4   5     7.0  8.0

In [117]:
# we can give names for both column lebals
pd.concat({"level 1": df1, "level 2": df2}, axis="columns", names = ['Outer', 'Inner'])

Outer level 1     level 2
Inner     one two   three four
a           0   1     5.0  6.0
b           2   3     NaN  NaN
c           4   5     7.0  8.0

####  Combining Data with Overlap

The combine_first() method is used to fill missing values in one DataFrame with values from another. This is useful when you have overlapping data sources where one DataFrame has gaps that can be filled from another.

In [118]:
s1 = pd.Series([np.nan, 2.4, 5.7, 4, np.nan, 3.4],
              index = ['a', 'b', 'c', 'd', 'e', 'f'])

s2 = pd.Series([4.9, 2.4, 5.7, 4],
              index = ['g', 'a', 'e', 'd'])

In [119]:
s1

a    NaN
b    2.4
c    5.7
d    4.0
e    NaN
f    3.4
dtype: float64

In [120]:
s2

g    4.9
a    2.4
e    5.7
d    4.0
dtype: float64

In [121]:
# using "combine_first()" to fill the missing values of "s1" from "s2"
s1.combine_first(s2)

a    2.4
b    2.4
c    5.7
d    4.0
e    5.7
f    3.4
g    4.9
dtype: float64

In [122]:
# combine first for dataframes works the same
a = pd.DataFrame({
    'CustomerID': [1, 2, 3],
    'Email': ['alice@example.com', None, 'charlie@example.com']
}).set_index('CustomerID')

b = pd.DataFrame({
    'CustomerID': [2, 3, 4],
    'Email': ['bob@example.com', 'charlie_new@example.com', 'david@example.com']
}).set_index('CustomerID')

In [123]:
a

                          Email
CustomerID
1             alice@example.com
2                          None
3           charlie@example.com

In [124]:
b

                              Email
CustomerID
2                   bob@example.com
3           charlie_new@example.com
4                 david@example.com

In [125]:
a.combine_first(b)

                          Email
CustomerID
1             alice@example.com
2               bob@example.com
3           charlie@example.com
4             david@example.com

# Examples

Example 1: Consolidate Quarterly Sales Data
Scenario:
You have four DataFrames representing quarterly sales data. Your task is to combine them vertically into one annual DataFrame and then calculate the total annual sales.

In [126]:
q1 = pd.DataFrame({
    'Quarter': ['Q1'] * 3,
    'Date': ['2023-01-15', '2023-02-15', '2023-03-15'],
    'Sales': [200, 250, 300]
})

q2 = pd.DataFrame({
    'Quarter': ['Q2'] * 3,
    'Date': ['2023-04-15', '2023-05-15', '2023-06-15'],
    'Sales': [220, 270, 310]
})

q3 = pd.DataFrame({
    'Quarter': ['Q3'] * 3,
    'Date': ['2023-07-15', '2023-08-15', '2023-09-15'],
    'Sales': [230, 260, 320]
})

q4 = pd.DataFrame({
    'Quarter': ['Q4'] * 3,
    'Date': ['2023-10-15', '2023-11-15', '2023-12-15'],
    'Sales': [240, 280, 330]
})

In [127]:
q1

  Quarter        Date  Sales
0      Q1  2023-01-15    200
1      Q1  2023-02-15    250
2      Q1  2023-03-15    300

In [128]:
q2

  Quarter        Date  Sales
0      Q2  2023-04-15    220
1      Q2  2023-05-15    270
2      Q2  2023-06-15    310

In [129]:
q3

  Quarter        Date  Sales
0      Q3  2023-07-15    230
1      Q3  2023-08-15    260
2      Q3  2023-09-15    320

In [130]:
q4

  Quarter        Date  Sales
0      Q4  2023-10-15    240
1      Q4  2023-11-15    280
2      Q4  2023-12-15    330

In [131]:
df = pd.concat([q1, q2, q3, q4], ignore_index = True)

In [132]:
df

   Quarter        Date  Sales
0       Q1  2023-01-15    200
1       Q1  2023-02-15    250
2       Q1  2023-03-15    300
3       Q2  2023-04-15    220
4       Q2  2023-05-15    270
5       Q2  2023-06-15    310
6       Q3  2023-07-15    230
7       Q3  2023-08-15    260
8       Q3  2023-09-15    320
9       Q4  2023-10-15    240
10      Q4  2023-11-15    280
11      Q4  2023-12-15    330

In [133]:
# total sales
df['Sales'].sum()

np.int64(3210)

In [134]:
# sales by quarter
df.groupby('Quarter')['Sales'].sum()

Quarter
Q1    750
Q2    800
Q3    810
Q4    850
Name: Sales, dtype: int64

Example 2: Merge Departmental Data
Scenario:
You have one DataFrame with employee information (EmployeeID, Name) and another with performance metrics (EmployeeID, Rating, Bonus). Your task is to merge these DataFrames on EmployeeID to create a complete employee performance record.

In [135]:
employees = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

performance = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Rating': ['A', 'B', 'A'],
    'Bonus': [5000, 3000, 4000]
})

In [136]:
employees

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David

In [137]:
performance

   EmployeeID Rating  Bonus
0           1      A   5000
1           2      B   3000
2           4      A   4000

In [138]:
df = pd.merge(employees, performance, on = 'EmployeeID', how = 'inner')

In [139]:
df

   EmployeeID   Name Rating  Bonus
0           1  Alice      A   5000
1           2    Bob      B   3000
2           4  David      A   4000

Example 3: Fill Missing Inventory Data
Scenario:
A primary inventory DataFrame has missing stock values for some products. A secondary (backup) DataFrame provides stock information for some of these products. Your task is to use combine_first() to fill in the missing values from the backup DataFrame.

In [140]:
primary = pd.DataFrame({
    'ProductID': [101, 102, 103, 104],
    'Stock': [50, None, 30, None]
}).set_index('ProductID')

backup = pd.DataFrame({
    'ProductID': [103, 104, 105],
    'Stock': [60, 40, 25]
}).set_index('ProductID')

In [141]:
primary

           Stock
ProductID
101         50.0
102          NaN
103         30.0
104          NaN

In [142]:
backup

           Stock
ProductID
103           60
104           40
105           25

In [143]:
df = primary.combine_first(backup)

In [144]:
df

           Stock
ProductID
101         50.0
102          NaN
103         30.0
104         40.0
105         25.0

Example 4: Combining Regional Sales Data
Scenario:
Sales data is collected separately for two regions (North and South). Your task is to combine these DataFrames into one master DataFrame and then calculate the total sales by region.

In [145]:
north_sales = pd.DataFrame({
    'Region': ['North'] * 3,
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Sales': [200, 300, 250]
})

south_sales = pd.DataFrame({
    'Region': ['South'] * 3,
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Sales': [150, 350, 400]
})

In [146]:
north_sales

  Region        Date  Sales
0  North  2023-01-01    200
1  North  2023-01-02    300
2  North  2023-01-03    250

In [147]:
south_sales

  Region        Date  Sales
0  South  2023-01-01    150
1  South  2023-01-02    350
2  South  2023-01-03    400

In [148]:
df = pd.concat([north_sales, south_sales], ignore_index = True)

In [149]:
df

  Region        Date  Sales
0  North  2023-01-01    200
1  North  2023-01-02    300
2  North  2023-01-03    250
3  South  2023-01-01    150
4  South  2023-01-02    350
5  South  2023-01-03    400

In [150]:
# total sales by region
df.groupby('Region')['Sales'].sum()

Region
North    750
South    900
Name: Sales, dtype: int64

Example 5: Combining Employee Data from Multiple Branches
Scenario:
A company has separate DataFrames for employees working in different branches. Your task is to combine these DataFrames vertically into one master DataFrame, and then group the data to count the number of employees in each department.

In [151]:
branch1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Department': ['HR', 'IT', 'Sales']
})

branch2 = pd.DataFrame({
    'EmployeeID': [4, 5],
    'Name': ['David', 'Eva'],
    'Department': ['Marketing', 'IT']
})

In [152]:
branch1

   EmployeeID     Name Department
0           1    Alice         HR
1           2      Bob         IT
2           3  Charlie      Sales

In [153]:
branch2

   EmployeeID   Name Department
0           4  David  Marketing
1           5    Eva         IT

In [154]:
df = pd.concat([branch1, branch2],  ignore_index = True)

In [155]:
df

   EmployeeID     Name Department
0           1    Alice         HR
1           2      Bob         IT
2           3  Charlie      Sales
3           4    David  Marketing
4           5      Eva         IT

In [156]:
df.groupby('Department').size().reset_index(name = 'Count')

  Department  Count
0         HR      1
1         IT      2
2  Marketing      1
3      Sales      1

Example 6: Joining Orders and Shipping Data on Multiple Keys
Scenario:
A company maintains one DataFrame for orders and another for shipping information. Both DataFrames share common keys—OrderID and OrderDate—to ensure the shipping record corresponds exactly to an order. Your task is to merge these DataFrames using both keys so that only matching orders with shipping details are retained.

In [157]:
orders = pd.DataFrame({
    'OrderID': [1001, 1002, 1003, 1004],
    'CustomerID': [1, 2, 3, 4],
    'OrderDate': ['2023-01-15', '2023-01-16', '2023-01-17', '2023-01-18'],
    'OrderAmount': [250, 150, 300, 200]
})

shipping = pd.DataFrame({
    'OrderID': [1001, 1002, 1004, 1005],
    'OrderDate': ['2023-01-15', '2023-01-16', '2023-01-18', '2023-01-19'],
    'ShippingMethod': ['Air', 'Ground', 'Air', 'Sea'],
    'ShippingDate': ['2023-01-16', '2023-01-17', '2023-01-19', '2023-01-20']
})

In [158]:
orders

   OrderID  CustomerID   OrderDate  OrderAmount
0     1001           1  2023-01-15          250
1     1002           2  2023-01-16          150
2     1003           3  2023-01-17          300
3     1004           4  2023-01-18          200

In [159]:
shipping

   OrderID   OrderDate ShippingMethod ShippingDate
0     1001  2023-01-15            Air   2023-01-16
1     1002  2023-01-16         Ground   2023-01-17
2     1004  2023-01-18            Air   2023-01-19
3     1005  2023-01-19            Sea   2023-01-20

In [160]:
df = pd.merge(orders, shipping, on = ['OrderID', 'OrderDate'], how = 'inner')

In [161]:
df

   OrderID  CustomerID   OrderDate  OrderAmount ShippingMethod ShippingDate
0     1001           1  2023-01-15          250            Air   2023-01-16
1     1002           2  2023-01-16          150         Ground   2023-01-17
2     1004           4  2023-01-18          200            Air   2023-01-19

#  8.3 Reshaping and Pivoting

There are a number of basic operations for rearranging tabular data. These are referred to as reshape or pivot operations.

Stacking and Unstacking
Stacking and unstacking are used primarily with hierarchical indexes (MultiIndex). They allow you to pivot data between columns and rows.

unstack(level): Moves one or more levels of the row index to become columns.
stack(level): The inverse of unstack; it pivots column levels back into the row index.

In [162]:
# let's take a simple example
df = pd.DataFrame(np.random.randint(1, 100, size = (2, 3)),
                 columns = pd.Index(['One', 'Two', 'Three'], name = 'number'),
                 index = pd.Index(['China', 'USA'], name = 'Country'))

In [163]:
df

number   One  Two  Three
Country
China     54   37     30
USA       47   99     37

In [164]:
# let's stack df
dfs = df.stack()

In [165]:
dfs

Country  number
China    One       54
         Two       37
         Three     30
USA      One       47
         Two       99
         Three     37
dtype: int32

In [166]:
# we can back to the original by unstacking
dfu = dfs.unstack()

In [167]:
dfu

number   One  Two  Three
Country
China     54   37     30
USA       47   99     37

In [168]:
# by default the "unstack()" method unstacks the inner level so we can specify the level 
dfs.unstack(level = 'number')

number   One  Two  Three
Country
China     54   37     30
USA       47   99     37

In [169]:
dfs.unstack(level = 'Country')

Country  China  USA
number
One         54   47
Two         37   99
Three       30   37

In [170]:
dfs.unstack(level = 0)

Country  China  USA
number
One         54   47
Two         37   99
Three       30   37

Unstacking might introduce missing data if all of the values in the level aren’t found in each subgroup:

In [171]:
s1 = pd.Series([0, 1, 2, 3], index=["a", "b", "c", "d"], dtype="Int64")
s1

a    0
b    1
c    2
d    3
dtype: Int64

In [172]:
s2 = pd.Series([4, 5, 6], index=["c", "d", "e"], dtype="Int64")
s2

c    4
d    5
e    6
dtype: Int64

In [173]:
s = pd.concat([s1, s2], keys = ['One', 'Two'])

In [174]:
s

One  a    0
     b    1
     c    2
     d    3
Two  c    4
     d    5
     e    6
dtype: Int64

In [175]:
su = s.unstack()

In [176]:
su

        a     b  c  d     e
One     0     1  2  3  <NA>
Two  <NA>  <NA>  4  5     6

In [177]:
# let's stack back
ss = su.stack()

In [178]:
ss

One  a    0
     b    1
     c    2
     d    3
Two  c    4
     d    5
     e    6
dtype: Int64

In [179]:
# but if we want we can keep the missing values
su.stack(future_stack=True)

One  a       0
     b       1
     c       2
     d       3
     e    <NA>
Two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

When you unstack in a DataFrame, the level unstacked becomes the lowest level in the result:

In [180]:
tuples = [
    ('2023-01-01', 'North', 'Widget'),
    ('2023-01-01', 'North', 'Gadget'),
    ('2023-01-01', 'South', 'Widget'),
    ('2023-01-01', 'South', 'Gadget'),
    ('2023-01-02', 'North', 'Widget'),
    ('2023-01-02', 'North', 'Gadget'),
    ('2023-01-02', 'South', 'Widget'),
    ('2023-01-02', 'South', 'Gadget'),
]
index = pd.MultiIndex.from_tuples(tuples, names=['Date', 'Region', 'Product'])
df = pd.DataFrame({'Sales': [200, 150, 180, 130, 220, 160, 190, 140]}, index=index)

In [181]:
df

                           Sales
Date       Region Product
2023-01-01 North  Widget     200
                  Gadget     150
           South  Widget     180
                  Gadget     130
2023-01-02 North  Widget     220
                  Gadget     160
           South  Widget     190
                  Gadget     140

In [182]:
# unstacking specific levels
# let's unstack 'Product'
dfp = df.unstack(level = 'Product')
dfp

                   Sales
Product           Gadget Widget
Date       Region
2023-01-01 North     150    200
           South     130    180
2023-01-02 North     160    220
           South     140    190

In [183]:
# let's unstack 'Region'
df.unstack(level = 'Region')

                   Sales
Region             North South
Date       Product
2023-01-01 Gadget    150   130
           Widget    200   180
2023-01-02 Gadget    160   140
           Widget    220   190

In [184]:
# unstacking multiple levels
# unstacking both 'Region' and 'Product'
dfb = df.unstack(level = ['Region', 'Product'])
dfb

            Sales
Region      North         South
Product    Widget Gadget Widget Gadget
Date
2023-01-01    200    150    180    130
2023-01-02    220    160    190    140

Stacking

In [185]:
dfp

                   Sales
Product           Gadget Widget
Date       Region
2023-01-01 North     150    200
           South     130    180
2023-01-02 North     160    220
           South     140    190

In [186]:
dfp.stack(level = 'Product', future_stack = True)

                           Sales
Date       Region Product
2023-01-01 North  Gadget     150
                  Widget     200
           South  Gadget     130
                  Widget     180
2023-01-02 North  Gadget     160
                  Widget     220
           South  Gadget     140
                  Widget     190

In [187]:
dfb

            Sales
Region      North         South
Product    Widget Gadget Widget Gadget
Date
2023-01-01    200    150    180    130
2023-01-02    220    160    190    140

In [188]:
dfb.stack(level = 'Product', future_stack = True)

                   Sales
Region             North South
Date       Product
2023-01-01 Widget    200   180
           Gadget    150   130
2023-01-02 Widget    220   190
           Gadget    160   140

# Example

Scenario:
You have a MultiIndex DataFrame with sales data for multiple regions and product categories on various dates. You need to:

Unstack the product level to create a wide format where each product is a column.
Compute the total sales for each date.
Stack the DataFrame back to a long format for further analysis.

In [189]:
tuples = [
    ('2023-01-01', 'North', 'Widget'),
    ('2023-01-01', 'North', 'Gadget'),
    ('2023-01-01', 'South', 'Widget'),
    ('2023-01-01', 'South', 'Gadget'),
    ('2023-01-02', 'North', 'Widget'),
    ('2023-01-02', 'North', 'Gadget'),
    ('2023-01-02', 'South', 'Widget'),
    ('2023-01-02', 'South', 'Gadget'),
]
index = pd.MultiIndex.from_tuples(tuples, names=['Date', 'Region', 'Product'])
sales_data = pd.DataFrame({'Sales': [200, 150, 180, 130, 220, 160, 190, 140]}, index=index)

In [190]:
sales_data

                           Sales
Date       Region Product
2023-01-01 North  Widget     200
                  Gadget     150
           South  Widget     180
                  Gadget     130
2023-01-02 North  Widget     220
                  Gadget     160
           South  Widget     190
                  Gadget     140

In [191]:
# unstack the product level
df_unstacked = sales_data.unstack(level = 'Product')

In [192]:
df_unstacked

                   Sales
Product           Gadget Widget
Date       Region
2023-01-01 North     150    200
           South     130    180
2023-01-02 North     160    220
           South     140    190

In [193]:
sales_data.groupby('Date')['Sales'].sum().reset_index(name = 'Total_Sales')

         Date  Total_Sales
0  2023-01-01          660
1  2023-01-02          710

In [194]:
# restack the unstacked
df_unstacked.stack(level = 'Product', future_stack=True)

                           Sales
Date       Region Product
2023-01-01 North  Gadget     150
                  Widget     200
           South  Gadget     130
                  Widget     180
2023-01-02 North  Gadget     160
                  Widget     220
           South  Gadget     140
                  Widget     190

####  Pivoting “Long” to “Wide” Format

Understanding the Long vs. Wide Format

Long Format:
In the long format, data is organized so that one variable (e.g., time, category) is repeated across rows.
Example:

Date	   Region  Sales
2023-01-01	North	200
2023-01-01	South	150
2023-01-02	North	250
2023-01-02	South	180

Wide Format:
In the wide format, each unique value of a variable becomes a separate column.
Example:

Date	   North   South
2023-01-01	200	    150
2023-01-02	250	    180

Methods for Pivoting

pivot()
Use when the index/column combination is unique (i.e., no duplicate pairs exist).
If there are duplicates for a given combination, pivot() will raise an error.

df_wide = df_long.pivot(index='row_identifier', columns='column_identifier', values='value_column')

In [195]:
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'Region': ['North', 'South', 'North', 'South'],
    'Sales': [200, 150, 250, 180]
}
df_long = pd.DataFrame(data)

In [196]:
df_long

         Date Region  Sales
0  2023-01-01  North    200
1  2023-01-01  South    150
2  2023-01-02  North    250
3  2023-01-02  South    180

In [197]:
df = df_long.pivot(index = 'Date', columns = 'Region', values = 'Sales')

In [198]:
df

Region      North  South
Date
2023-01-01    200    150
2023-01-02    250    180

In [199]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science', 'History', 'History', 'History'],
    'Score': [88, 76, 93, 91, 85, 89, 79, 80, 84],
    'Teacher': ['Mr. Smith', 'Mr. Smith', 'Mr. Smith', 
                'Mrs. Johnson', 'Mrs. Johnson', 'Mrs. Johnson', 
                'Ms. Clark', 'Ms. Clark', 'Ms. Clark']
}

df = pd.DataFrame(data)

In [200]:
df

   Student  Subject  Score       Teacher
0    Alice     Math     88     Mr. Smith
1      Bob     Math     76     Mr. Smith
2  Charlie     Math     93     Mr. Smith
3    Alice  Science     91  Mrs. Johnson
4      Bob  Science     85  Mrs. Johnson
5  Charlie  Science     89  Mrs. Johnson
6    Alice  History     79     Ms. Clark
7      Bob  History     80     Ms. Clark
8  Charlie  History     84     Ms. Clark

In [201]:
df.pivot(index = 'Student', columns = 'Subject', values = 'Score')

Subject  History  Math  Science
Student
Alice         79    88       91
Bob           80    76       85
Charlie       84    93       89

In [202]:
data = {
    'Date': ['2024-02-01', '2024-02-01', '2024-02-02', '2024-02-02', '2024-02-03', '2024-02-03'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'Temperature': [45, 60, 50, 65, 48, 62],
    'Humidity': [70, 55, 65, 50, 72, 53]
}

df = pd.DataFrame(data)

In [203]:
df

         Date         City  Temperature  Humidity
0  2024-02-01     New York           45        70
1  2024-02-01  Los Angeles           60        55
2  2024-02-02     New York           50        65
3  2024-02-02  Los Angeles           65        50
4  2024-02-03     New York           48        72
5  2024-02-03  Los Angeles           62        53

In [204]:
df.pivot(index = 'Date', columns = 'City')

           Temperature             Humidity
City       Los Angeles New York Los Angeles New York
Date
2024-02-01          60       45          55       70
2024-02-02          65       50          50       65
2024-02-03          62       48          53       72

In [205]:
df.pivot(index = 'Date', columns = 'City', values = 'Temperature')

City        Los Angeles  New York
Date
2024-02-01           60        45
2024-02-02           65        50
2024-02-03           62        48

In [206]:
df.pivot(index = 'City', columns = 'Date', values = 'Humidity')

Date         2024-02-01  2024-02-02  2024-02-03
City
Los Angeles          55          50          53
New York             70          65          72

In [207]:
data = {
    'Date': ['2024-02-01', '2024-02-01', '2024-02-02', '2024-02-02'],
    'City': ['New York', 'New York', 'Los Angeles', 'Los Angeles'],
    'Temperature': [45, 47, 60, 62],
    'Humidity': [70, 68, 55, 57]
}

df1 = pd.DataFrame(data)

In [208]:
df1

         Date         City  Temperature  Humidity
0  2024-02-01     New York           45        70
1  2024-02-01     New York           47        68
2  2024-02-02  Los Angeles           60        55
3  2024-02-02  Los Angeles           62        57

In [209]:
# the combination of Date and City is not unique, which will cause the pivot() method to raise an error.
# df1.pivot(index = 'Date', columns = 'City', values = 'Temperature')    # raise an error

pivot_table()
Use when you may have duplicate pairs. It can aggregate duplicates using an aggregation function (like sum, mean, etc.).
Can handle duplicate combinations gracefully by aggregating values.

df_wide = pd.pivot_table(df_long, values='value_column', index='row_identifier', columns='column_identifier', aggfunc='aggregation_function')

In [210]:
data_dup = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'Region': ['North', 'North', 'South', 'North', 'South'],
    'Sales': [200, 50, 150, 250, 180]
}
df_long_dup = pd.DataFrame(data_dup)

In [211]:
df_long_dup

         Date Region  Sales
0  2023-01-01  North    200
1  2023-01-01  North     50
2  2023-01-01  South    150
3  2023-01-02  North    250
4  2023-01-02  South    180

In [212]:
pd.pivot_table(df_long_dup, values = 'Sales', index = 'Date', columns = 'Region', aggfunc = 'sum')

Region      North  South
Date
2023-01-01    250    150
2023-01-02    250    180

In [213]:
# Create a more detailed sample dataset
data = {
    'OrderID': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015],
    'OrderDate': [
        '2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-03', 
        '2024-01-03', '2024-01-04', '2024-01-04', '2024-01-05', '2024-01-05',
        '2024-01-06', '2024-01-06', '2024-01-07', '2024-01-07', '2024-01-08'
    ],
    'Region': [
        'East', 'East', 'East', 'West', 'West', 
        'North', 'North', 'South', 'South', 'East', 
        'West', 'North', 'South', 'East', 'West'
    ],
    'Store': [
        'Store A', 'Store B', 'Store A', 'Store C', 'Store D', 
        'Store E', 'Store E', 'Store F', 'Store F', 'Store A', 
        'Store C', 'Store E', 'Store F', 'Store B', 'Store D'
    ],
    'Product': [
        'Laptop', 'Chair', 'Desk', 'Laptop', 'Desk', 
        'Chair', 'Desk', 'Laptop', 'Chair', 'Laptop', 
        'Chair', 'Desk', 'Laptop', 'Desk', 'Chair'
    ],
    'Category': [
        'Technology', 'Furniture', 'Furniture', 'Technology', 'Furniture', 
        'Furniture', 'Furniture', 'Technology', 'Furniture', 'Technology', 
        'Furniture', 'Furniture', 'Technology', 'Furniture', 'Furniture'
    ],
    'Sales': [1200, 300, 450, 1300, 480, 350, 460, 1250, 320, 1190, 310, 470, 1280, 500, 330],
    'Profit': [200, 50, 70, 220, 80, 60, 75, 210, 55, 195, 45, 72, 205, 85, 58],
    'Quantity': [1, 4, 2, 1, 2, 3, 2, 1, 4, 1, 4, 2, 1, 2, 3]
}
df = pd.DataFrame(data)

In [214]:
df

,OrderID,OrderDate,Region,Store,Product,Category,Sales,Profit,Quantity
0,1001,2024-01-01,East,Store A,Laptop,Technology,1200,200,1
1,1002,2024-01-01,East,Store B,Chair,Furniture,300,50,4
2,1003,2024-01-02,East,Store A,Desk,Furniture,450,70,2
3,1004,2024-01-02,West,Store C,Laptop,Technology,1300,220,1
4,1005,2024-01-03,West,Store D,Desk,Furniture,480,80,2
5,1006,2024-01-03,North,Store E,Chair,Furniture,350,60,3
6,1007,2024-01-04,North,Store E,Desk,Furniture,460,75,2
7,1008,2024-01-04,South,Store F,Laptop,Technology,1250,210,1
8,1009,2024-01-05,South,Store F,Chair,Furniture,320,55,4
9,1010,2024-01-05,East,Store A,Laptop,Technology,1190,195,1
10,1011,2024-01-06,West,Store C,Chair,Furniture,310,45,4
11,1012,2024-01-06,North,Store E,Desk,Furniture,470,72,2
12,1013,2024-01-07,South,Store F,Laptop,Technology,1280,205,1
13,1014,2024-01-07,East,Store B,Desk,Furniture,500,85,2
14,1015,2024-01-08,West,Store D,Chair,Furniture,330,58,3

In [215]:
# Total Sales by Region and Product:
pd.pivot_table(df, values = 'Sales', index = 'Region', columns = 'Product', fill_value = 0, aggfunc = 'sum')

Product  Chair  Desk  Laptop
Region
East       300   950    2390
North      350   930       0
South      320     0    2530
West       640   480    1300

In [216]:
# Average Profit by Category and Region
pd.pivot_table(df, values = 'Profit', columns = 'Region', index = 'Category', fill_value = 0, aggfunc = 'mean')

Region            East  North  South   West
Category
Furniture    68.333333   69.0   55.0   61.0
Technology  197.500000    0.0  207.5  220.0

In [217]:
# Total Quantity Sold by Store and Product
pd.pivot_table(df, values = 'Quantity', index = 'Store', columns = 'Product', fill_value = 0, aggfunc = 'sum')

Product  Chair  Desk  Laptop
Store
Store A      0     2       2
Store B      4     2       0
Store C      4     0       1
Store D      3     2       0
Store E      3     4       0
Store F      4     0       2

####  Pivoting “Wide” to “Long” Format

An inverse operation to pivot for DataFrames is pandas.melt. Rather than transforming one column into many in a new DataFrame, it merges multiple columns into one, producing a DataFrame that is longer than the input

What is Melting?
Wide Format:
Data is spread out across multiple columns. For example, sales data might have one column per month.

Long Format:
Data is normalized so that one variable is stored in a single column, and each row is an observation. For example, months become a single column and sales values another.

Why Melt?

Many statistical and plotting libraries expect data in long format.
It simplifies operations like grouping, filtering, or applying functions across a variable.
It makes the dataset tidy—one observation per row, one variable per column.

pd.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True)

frame: The DataFrame you want to melt.
id_vars: Columns to use as identifier variables (these remain unchanged).
value_vars: Columns to unpivot (if not provided, all columns not in id_vars are used).
var_name: Name to use for the ‘variable’ column.
value_name: Name to use for the ‘value’ column.
ignore_index: If True, the original index is ignored.

In [218]:
data = {
    'Product': ['Widget A', 'Widget B'],
    'Jan': [100, 150],
    'Feb': [120, 160],
    'Mar': [130, 170]
}
df_wide = pd.DataFrame(data)

In [219]:
df_wide

    Product  Jan  Feb  Mar
0  Widget A  100  120  130
1  Widget B  150  160  170

In [220]:
df_long = pd.melt(df_wide, 
                  id_vars='Product',         # Columns to keep fixed
                  value_vars=['Jan', 'Feb', 'Mar'],  # Columns to melt
                  var_name='Month',          # New column name for variable names
                  value_name='Sales')        # New column name for values

In [221]:
df_long

    Product Month  Sales
0  Widget A   Jan    100
1  Widget B   Jan    150
2  Widget A   Feb    120
3  Widget B   Feb    160
4  Widget A   Mar    130
5  Widget B   Mar    170

In [222]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [88, 92, 75],
    'Science': [95, 89, 84],
    'History': [80, 77, 90]
}

df = pd.DataFrame(data)

In [223]:
df

   Student  Math  Science  History
0    Alice    88       95       80
1      Bob    92       89       77
2  Charlie    75       84       90

In [224]:
pd.melt(df, id_vars = 'Student', value_vars = ['Math', 'Science', 'History'], var_name = 'Subject', value_name = 'Score')

   Student  Subject  Score
0    Alice     Math     88
1      Bob     Math     92
2  Charlie     Math     75
3    Alice  Science     95
4      Bob  Science     89
5  Charlie  Science     84
6    Alice  History     80
7      Bob  History     77
8  Charlie  History     90

In [225]:
data = {
    'Store_ID': [101, 102, 103],
    'Store': ['Store A', 'Store B', 'Store C'],
    'Region': ['North', 'South', 'East'],
    'Sales_Jan': [20000, 15000, 18000],
    'Sales_Feb': [21000, 16000, 17500],
    'Sales_Mar': [22000, 17000, 19000]
}

df_retail = pd.DataFrame(data)

In [226]:
df_retail

   Store_ID    Store Region  Sales_Jan  Sales_Feb  Sales_Mar
0       101  Store A  North      20000      21000      22000
1       102  Store B  South      15000      16000      17000
2       103  Store C   East      18000      17500      19000

In [227]:
df_l = pd.melt(df_retail, id_vars = ['Store_ID', 'Store', 'Region'], var_name = 'Month', value_name = 'Sales')

In [228]:
df_l

   Store_ID    Store Region      Month  Sales
0       101  Store A  North  Sales_Jan  20000
1       102  Store B  South  Sales_Jan  15000
2       103  Store C   East  Sales_Jan  18000
3       101  Store A  North  Sales_Feb  21000
4       102  Store B  South  Sales_Feb  16000
5       103  Store C   East  Sales_Feb  17500
6       101  Store A  North  Sales_Mar  22000
7       102  Store B  South  Sales_Mar  17000
8       103  Store C   East  Sales_Mar  19000

In [229]:
df_l['Month'] = df_l['Month'].str.replace('Sales_', '')

In [230]:
df_l

   Store_ID    Store Region Month  Sales
0       101  Store A  North   Jan  20000
1       102  Store B  South   Jan  15000
2       103  Store C   East   Jan  18000
3       101  Store A  North   Feb  21000
4       102  Store B  South   Feb  16000
5       103  Store C   East   Feb  17500
6       101  Store A  North   Mar  22000
7       102  Store B  South   Mar  17000
8       103  Store C   East   Mar  19000

In [231]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie'],
    'Department': ['HR', 'IT', 'Finance'],
    'Q1': [88, 92, 85],
    'Q2': [90, 89, 87],
    'Q3': [85, 94, 90],
    'Q4': [91, 88, 86]
}

df_performance = pd.DataFrame(data)

In [232]:
df_performance

  Employee Department  Q1  Q2  Q3  Q4
0    Alice         HR  88  90  85  91
1      Bob         IT  92  89  94  88
2  Charlie    Finance  85  87  90  86

In [233]:
df = pd.melt(df_performance, id_vars = ['Employee', 'Department'], value_vars = ['Q1', 'Q2', 'Q3', 'Q4'], var_name = 'Quarter', value_name = 'Score')

In [234]:
df

   Employee Department Quarter  Score
0     Alice         HR      Q1     88
1       Bob         IT      Q1     92
2   Charlie    Finance      Q1     85
3     Alice         HR      Q2     90
4       Bob         IT      Q2     89
5   Charlie    Finance      Q2     87
6     Alice         HR      Q3     85
7       Bob         IT      Q3     94
8   Charlie    Finance      Q3     90
9     Alice         HR      Q4     91
10      Bob         IT      Q4     88
11  Charlie    Finance      Q4     86